SONGS = [
    {
        "title": "그리스도 안에서",
        "parts": {
            "A": """
                창세 전에 그리스도 안에서
                사랑으로 우리를 택하시고

                주님의 그 사랑 안에서
                거룩하고 흠이 없게 하셨네

                주님의 값없는 은혜의
                영광을 찬송케 하시려

                하나님이 사랑하시는 자 안에서
                그 생명을 거저 주셨네
                """,
            "B": """
                우리는 그리스도 안에서 은혜의 풍성함 따라
                그의 피로 말미암아 죄 사함 받았네

                그 기쁘신 뜻대로 우리를 예정하사
                주 예수로 말미암아 자녀가 되었네
                """,
            "C": """
                주님의 뜻을 우리게 보여주셨네
                그의 사랑으로 날 건지셨네

                모든 만물이 
                주 예수 안에서 연합되네""",
        },
        "song_form": "(4)(1)AB(4)ABBCBB(기도)",
    },
    {
        "title": "말씀이 육신되어",
        "parts": {
            "A": """
                말씀이 육신 되어 이 땅에 오신 예수
                모든 어둠 이기고 영원한 생명 되신
                하늘의 통치자 이 땅에 임하셨네
                
                어둠을 밝히시고 죽음을 이기신 주
                내 안에 오셔서 주의 뜻 이루시네
                하늘의 통치가 온 땅에 충만하네
                """,
            "B": """
                주님의 영광 내게 임하네
                주의 성령 날 이끄시네

                주의 말씀이 날 찾아오셔서
                다스리시네 온 땅 비추시네
                """,
        },
        "song_form": "(8)AB(4)ABBBB(8)",
    },
    {
        "title": "말씀이 육신되어",
        "parts": {
            "A1": """
                안개 속 어둔 땅에 진리의 빛 비추시니
                온 땅이 주를 갈망하네

                높고 거친 파도에 주 예수 앞서가시니
                나 담대히 따르네
                """,
            "A2": """
                모든 싸움 이긴 그날 모든 눈물 씻기시리
                우리 함께 영광 누리리

                강하고 크신 팔로 함께 싸우시네
                주 앞에 맞설 자 누구랴
                """,
            "B": """
                We will never stop!
                전신갑주 입고서

                We will carry the cross!
                세상에 선포하네

                거룩한 이름 예! 수!
                승리의 깃발 들어

                Jesus never stops!
                So we’ll never stop!
                """,
            "B1": """
                Jesus never stops!
                So we’ll never stop!
                """,
            "C": """
                주 예수 앞서가시니
                주 예수 따라가려네
                
                주 예수 승리 주시니
                주 예수 위해 싸우네
                
                주 예수 앞서가시니
                주 예수 따라가려네
                
                주 예수 승리 주시니
                주 예수 위해 싸우네
                
                주 예수 앞서가시니
                주 예수 따라가려네
                
                주 예수 승리 주시니
                주 예수 위해 싸우네
                """,
        },
        "song_form": "(4)(8)A1B A2B (8)CBBB1",
    },
]
