SONGS = [
    {
        "title": "그리스도 안에서",
        "parts": {
            "A": """
                창세 전에 그리스도 안에서
                사랑으로 우리를 택하시고

                주님의 그 사랑 안에서
                거룩하고 흠이 없게 하셨네

                주님의 값없는 은혜의
                영광을 찬송케 하시려

                하나님이 사랑하시는 자 안에서
                그 생명을 거저 주셨네
                """,
            "B": """
                우리는 그리스도 안에서 은혜의 풍성함 따라
                그의 피로 말미암아 죄 사함 받았네

                그 기쁘신 뜻대로 우리를 예정하사
                주 예수로 말미암아 자녀가 되었네
                """,
            "C": """
                주님의 뜻을 우리게 보여주셨네
                그의 사랑으로 날 건지셨네

                모든 만물이 
                주 예수 안에서 연합되네""",
        },
        "song_form": "(4)(1)AB(4)ABBCBB(기도)",
    },
    {
        "title": "말씀이 육신되어",
        "parts": {
            "A": """
                말씀이 육신 되어 
                이 땅에 오신 예수
                
                모든 어둠 이기고 
                영원한 생명 되신
                
                하늘의 통치자 
                이 땅에 임하셨네
                
                어둠을 밝히시고
                죽음을 이기신 주

                내 안에 오셔서 
                주의 뜻 이루시네

                하늘의 통치가 
                온 땅에 충만하네
                """,
            "B": """
                주님의 영광 
                내게 임하네

                주의 성령 
                날 이끄시네

                주의 말씀이 
                날 찾아오셔서

                다스리시네 
                온 땅 비추시네
                """,
        },
        "song_form": "(8)AB(4)ABBBB(8)",
    },
    {
        "title": "We Will Never Stop",
        "parts": {
            "A1": """
                안개 속 어둔 땅에 
                진리의 빛 비추시니

                온 땅이 주를 갈망하네

                높고 거친 파도에 
                주 예수 앞서가시니
                
                나 담대히 따르네
                """,
            "A2": """
                모든 싸움 이긴 그날 
                모든 눈물 씻기시리
                
                우리 함께 영광 누리리

                강하고 크신 팔로 
                함께 싸우시네
                
                주 앞에 맞설 자 누구랴
                """,
            "B": """
                We will never stop!
                전신갑주 입고서

                We will carry the cross!
                세상에 선포하네

                거룩한 이름 예! 수!
                승리의 깃발 들어

                Jesus never stops!
                So we’ll never stop!
                """,
            "B1": """
                Jesus never stops!
                So we’ll never stop!
                """,
            "C": """
                주 예수 앞서가시니
                주 예수 따라가려네
                
                주 예수 승리 주시니
                주 예수 위해 싸우네
                
                주 예수 앞서가시니
                주 예수 따라가려네
                
                주 예수 승리 주시니
                주 예수 위해 싸우네
                
                주 예수 앞서가시니
                주 예수 따라가려네
                
                주 예수 승리 주시니
                주 예수 위해 싸우네
                """,
        },
        "song_form": "(4)(8)A1B A2B (8)CBBB1",
    },
    {
        "title": "오직 예수",
        "parts": {
            "A1": """
                    주 발 앞에 나 엎드려
                    주만 간절히 원해

                    주 계신 곳 나 바라봅니다
                    근심 속에 주 찾을 때

                    모든 필요 내려놓고
                    겸손하게 모두 드리리
    """,
            "B": """
                    오직 예수 주님만이
                    나의 삶의 이유

                    오직 예수 주님만이
                    나의 삶의 이유

                    오직 예수 주님만이
                    나의 삶의 이유

                    오직 예수 주님만이
                    나의 삶의 이유
    """,
            "A2": """
                    언제나 어디서나
                    크고 깊은 은혜로

                    주님 항상 내 안에 계시네
                    변함 없으신 주님

                    어제 오늘 영원히
                    한결같이 함께 하시네
    """,
            "C": """
                    주님은 길과 진리 생명
                    나는 오직 믿음으로 살리

                    주만 위해 살리
                    주님은 길과 진리 생명

                    나는 오직 믿음으로 살리
                    주만 위해 살리
    """,
        },
        "song_form": "(8)(8)A1B(8)A2B(8)CCBB(8)",
    },
    {
        "title": "나는 주의 친구",
        "parts": {
            "A": """
                    주님 어찌 날 생각하시는지 
                    들으시는지 내 기도 

                    주님 진실로 날 생각하시네 
                    날 사랑하네 놀라워라
    """,
            "B": """
                    나는 주의 친구 나는 주의 친구 
                    주님 날 친구로 부르셨네 

                    나는 주의 친구 나는 주의 친구 
                    주님 날 친구로 부르셨네
    """,
            "C": """
                    전능하신 영광의 주 주는 내 친구
                    전능하신 영광의 주 주는 내 친구
    """,
        },
        "song_form": "AB(8)CCB",
    },
    {
        "title": "좋으신 하나님",
        "parts": {
            "A": """
                    좋으신 하나님 인자와 자비 영원히
                    좋으신 하나님 인자와 자비 영원히
    """,
            "B": """
                    각 나라 족속과 백성 방언
                    세상 모든 세대 영원토록
    """,
            "C": """
                    주 경배해 할렐루야 할렐루야
                    주 경배해 주 하나님

                    주 경배해 할렐루야 할렐루야
                    주 경배해 주 하나님 You are good!
    """,
            "C1": """
                    주 하나님 주 하나님 
                    주 하나님 주 하나님 

                    You are good!
    """,
            "D": """
                    You are good All the time
                    All the time You are good
    """,
        },
        "song_form": "(8)ABC(8)DDDAABC1",
    },
    {
        "title": "베드로의 고백",
        "parts": {
            "A": """
                    내가 가장 후회하지 않는 일
                    예수를 따르는 일

                    내 그물 버리고 내 사랑들 뒤로하고
                    나를 부르신 주님과 동행하는 일

                    나의 평생에 소원하는 일
                    예수를 닮아 가는 일

                    굳은 마음 제하시고 사랑을 가르치신
                    나의 예수님을 사랑하는 일
    """,
            "B": """
                    날 부르심에 감사
                    날 놓지 않으심 감사

                    하늘 보좌 버리고
                    날 사랑하심에 감사

                    나의 모든 삶을 
                    남은 모든 인생을

                    예수님과 함께 걷겠습니다
    """,
            "C1": """
                    네가 나를 사랑하느냐
                    네가 나를 사랑하느냐

                    네가 나를 사랑하느냐
                    주님 내게 물어보시네
    """,
            "C2": """
                    내가 주를 사랑합니다
                    내가 주를 사랑합니다

                    내가 주를 사랑합니다
                    내가 주를 사랑합니다

                    내가 주를 사랑합니다
                    내가 주를 사랑합니다

                    내가 주를 사랑합니다
                    내 사랑을 주가 아십니다
    """,
            "C3": """
                    내가 주를 사랑합니다
                    내가 주를 사랑합니다

                    내가 주를 사랑합니다
                    내 사랑을 주가 아십니다
    """,
        },
        "song_form": "(4)ABABB(8)C1C2C3BB",
    },
    {
        "title": "나는 일어섭니다",
        "parts": {
            "B": """
                    나는 일어섭니다
                    더 이상 내 삶에 아픔이 아프게 두지 않겠습니다

                    나는 예배합니다
                    내게 약속하신 그 자리로 다시 한번 나아갑니다
    """,
        },
        "song_form": "BB(16)B",
    },
    {
        "title": "C1_나의 맘을 채우는",
        "parts": {
            "A": """
                    나의 맘을 채우는 주 사랑밖에 없네
                    나의 맘을 만지는 주 손길밖에 없네

                    나의 길 인도하는 주 음성 나는 믿네
                    내 모든 삶의 고백 주님께만 있네
    """,
            "B": """
                    다 찬양 할렐루야 신실하신 주
                    모든 삶의 순간 함께하시네

                    다 찬양 할렐루야 소리 높여서
                    내 모든 삶의 이유되신 주를 찬양해
    """,
            "B1": """
                    다 찬양 할렐루야 신실하신 주
                    모든 삶의 순간 함께하시네

                    다 찬양 할렐루야 소리 높여서
                    내 모든 삶의 이유되신 주를 찬양해 예!
    """,
        },
        "song_form": "(4)AAB(4)ABBB1",
    },
    {
        "title": "C2_우리가 주를 더욱 사랑하고",
        "parts": {
            "A": """
                    한 사랑 우리게 찾아왔네

                    자기 몸 희생하며
                    확증해 내신 사랑

                    먼저 본이 되신 이가
                    우리게 명하시네

                    네 맘과 뜻 힘 다해
                    주를 사랑하라
    """,
            "B": """
                    무엇보다 뜨겁게 서로 사랑할지니
                    사랑이 모든 것을 덮어주네

                    사랑 가운데 우리 온전히 살아갈 때
                    우리 삶이 그의 기쁨 되네
    """,
            "C": """
                    우리가 주를 더욱 사랑하고
                    그 사랑 우리 삶에 녹여내어

                    서로를 더욱 섬기고 사랑할 때
                    하나님 나라 임하겠네

                    우리가 주를 더욱 노래하고
                    이곳에 함께 모여 찬양하니

                    모든 두렴과 걱정은 떠나가네
                    주 사랑만이 이곳에 가득해
    """,
            "C1": """
                    우리가 주를 더욱 사랑하고
                    그 사랑 우리 삶에 녹여내어

                    서로를 더욱 섬기고 사랑할 때
                    하나님 나라 임하겠네

                    우리가 주를 더욱 노래하고
                    이곳에 함께 모여 찬양하니

                    모든 두렴과 걱정은 떠나가네
                    주 사랑만이 이곳에 가득해
    """,
            "D": """
                    가득해 가득해
                    가득해 가득해

                    가득해 가득해
                    가득해 가득해
    """,
            "E": """
                    주 사랑만 이곳에
                    주 사랑만 이곳에

                    가득해
    """,
        },
        "song_form": "(12)ABC(2)ABC(6)DC1CE",
    },
    {
        "title": "C3_오직 예수",
        "parts": {
            "A1": """
                    주 발 앞에 나 엎드려
                    주만 간절히 원해

                    주 계신 곳 나 바라봅니다
                    근심 속에 주 찾을 때

                    모든 필요 내려놓고
                    겸손하게 모두 드리리
    """,
            "B": """
                    오직 예수 주님만이
                    나의 삶의 이유

                    오직 예수 주님만이
                    나의 삶의 이유

                    오직 예수 주님만이
                    나의 삶의 이유

                    오직 예수 주님만이
                    나의 삶의 이유
    """,
            "A2": """
                    언제나 어디서나
                    크고 깊은 은혜로

                    주님 항상 내 안에 계시네
                    변함 없으신 주님

                    어제 오늘 영원히
                    한결같이 함께 하시네
    """,
            "C": """
                    주님은 길과 진리 생명
                    나는 오직 믿음으로 살리

                    주만 위해 살리
                    주님은 길과 진리 생명

                    나는 오직 믿음으로 살리
                    주만 위해 살리
    """,
        },
        "song_form": "(8)(8)A1B(8)A2B(8)CCBB(8)",
    },
    {
        "title": "C4_함께 지어져 가네",
        "parts": {
            "A1": """
                    우리는 하나님의 자녀
                    주 사랑 안에 우리 거할 때

                    주님 나를 사랑하신 것 같이
                    우리도 서로 사랑할 수 있네
    """,
            "A2": """
                    우리는 주의 몸 된 교회
                    모든 지체가 하나될 때

                    예수님의 마음을 닮아가며
                    고통과 즐거움 함께 나누네
    """,
            "B": """
                    하나님 안에서 우리 서로 이어져
                    주가 거하실 성전이 되네

                    모퉁잇돌 되신 예수와
                    하나 되게 하신 성령 안에

                    함께 지어져 가네
    """,
            "B1": """
                    함께 지어져 가네
    """,
        },
        "song_form": "(4)A1A2B(4)A1A2BBBB1",
    },
]
